93percentai/esp32-ethernetviawifi/firmware/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"

# Flash / PSRAM (T-Dongle-S3 with LCD: 16 MB flash; PSRAM present on many units)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Wi-Fi
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=64
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=64
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP_WIFI_RX_BA_WIN=16
CONFIG_ESP_WIFI_IRAM_OPT=y
CONFIG_ESP_WIFI_RX_IRAM_OPT=y

# TinyUSB: composite CDC-NCM + CDC-ACM + HID (+ MSC forced on via tusb_override).
# MSC is NOT enabled here on purpose: enabling CONFIG_TINYUSB_MSC_ENABLED would
# compile esp_tinyusb's built-in tud_msc_* storage callbacks, which conflict with
# this firmware's own MSC callbacks (msc.c). Instead main/tusb_override/tusb_config.h
# forces CFG_TUD_MSC=1 while leaving the built-in helper out.
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_TINYUSB_CDC_COUNT=1
CONFIG_TINYUSB_CDC_RX_BUFSIZE=512
CONFIG_TINYUSB_CDC_TX_BUFSIZE=512
CONFIG_TINYUSB_NET_MODE_NCM=y
CONFIG_TINYUSB_HID_COUNT=1

# lwIP NAPT for the NAT tether (storage/HID hosting mode)
CONFIG_LWIP_IP_FORWARD=y
CONFIG_LWIP_IPV4_NAPT=y

# FATFS: long filenames for the SD card share
CONFIG_FATFS_LFN_HEAP=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_COLORS=y

# Compiler
CONFIG_COMPILER_OPTIMIZATION_PERF=y
